# GetTileGeometryGroup

## Description
Gets the tile resource's geometry group.

```pascal
FUNCTION GetTileGeometryGroup(tileHandle : HANDLE) : HANDLE;
```

```python

def vs.GetTileGeometryGroup(tileHandle):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|tileHandle|HANDLE|The handle to the tile from which to get the group.|

## Returns
A handle to the tile geometry group, if successful; nil otherwise.

## Examples
```pascal
tileGroupHandle := GetTileGeometryGroup(tileHandle);
```

## See Also
VS Functions:
CreateTile| ShowEditTileDialog| ShowEditTileSettingsDialog| ShowNewTileDialog| GetTileGeometryGroup| BeginGroupN| AddTileGeometryObject| GetTileGroupParent| IsTileGroupContainedObject| GetTileBackgroundColor| SetTileBackgroundColor| GetTileRepetitionPoint| SetTileRepetitionPoint| GetTileOffsetPoint| SetTileOffsetPoint

## Version
Availability: from Vectorworks 2011
## Category
* Document Attributes